{
	"EXTENSION_NAME": {
		"message": "Auto Text Expander for Google Chrome™"
		, "description": "Extension name."
	}

	, "EXTENSION_DESCRIPTION": {
		"message": "Create custom keyboard shortcuts to expand and replace text as you type!"
		, "description": "Extension description."
	}

	, "PAGE_ACTION_TITLE": {
		"message": "Auto Text Expander available on this page! Click to view options."
		, "description": "Page action default title."
	}

	, "TITLE_WARNING_POPUP": {
		"message": "Warning"
		, "description": "Title of warning popup."
	}

	, "MESSAGE_BACKUP_WARNING": {
		"message": "This will save your currently defined shortcuts on the screen and then overwrite the old backup."
		, "description": "Warning message when user is about to attempt backing up his or her shortcuts."
	}

	, "MESSAGE_RESTORE_WARNING": {
		"message": "This will overwrite your current shortcuts with your last backup!"
		, "description": "Warning message when user is about to attempt restoring his or her shortcuts from their last backup."
	}

	, "ERROR_BACKUP_FAILED": {
		"message": "Could not backup shortcuts! May be over size limit."
		, "description": "Error message to be displayed to user when backup fails."
	}

	, "ERROR_RESTORE_FAILED": {
		"message": "Could not restore backup! Data may be corrupted or storage limits may have changed."
		, "description": "Error message to be displayed to user when restore from backup fails."
	}

	, "ERROR_OVER_SPACE_QUOTA": {
		"message": "Over Chrome user storage quota!"
		, "description": "Error message to be displayed when user goes over the quota for total storage space that Chrome's sync API allows."
	}

	, "ERROR_OVER_ITEM_SPACE_QUOTA": {
		"message": "Over shortcut max length!"
		, "description": "Error message to be displayed when user goes over the quota for space per item that Chrome's sync API allows."
	}

	, "ERROR_OVER_ITEM_QUOTA": {
		"message": "Over Chrome user storage quota!"
		, "description": "Error message to be displayed when user goes over the max number of items that Chrome's sync API allows."
	}

	, "ERROR_DUPLICATE_ITEMS": {
		"message": "Duplicate shortcuts found!"
		, "description": "Error message to be displayed when duplicate shortcuts are found"
	}

	, "TEMPLATE": {
		"message": "Text"
		, "description": "Template"
	}

}
